In [1]:
import pandas as pd

In [2]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

In [3]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [5]:

departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [6]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [7]:
pd.merge(employees,departments, on= "DeptID")

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [8]:
pd.merge(employees,departments, on= "DeptID",how = "left")

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [9]:
pd.merge(employees,departments, on= "DeptID", how = "right")

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [10]:
pd.merge(employees,departments, on= "DeptID",how= "outer")

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [12]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"]})

In [13]:
df1

    Name
0  Alice
1    Bob

In [14]:
df2

      Name
0  Charlie
1    David

In [15]:
pd.concat([df1, df2])

      Name
0    Alice
1      Bob
0  Charlie
1    David

In [16]:
pd.concat([df1, df2], axis= 1)

    Name     Name
0  Alice  Charlie
1    Bob    David

In [17]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"], "score":[123,234]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"],"age":[18,23]})

In [18]:
df1

    Name  score
0  Alice    123
1    Bob    234

In [19]:
df2

      Name  age
0  Charlie   18
1    David   23

In [20]:
pd.concat([df1, df2])

      Name  score   age
0    Alice  123.0   NaN
1      Bob  234.0   NaN
0  Charlie    NaN  18.0
1    David    NaN  23.0

In [21]:
pd.concat([df1, df2], axis= 1)

    Name  score     Name  age
0  Alice    123  Charlie   18
1    Bob    234    David   23